---
kind: method
id: M:Autodesk.Revit.DB.LevelAssociationData.GetLevelOffset
source: html/9014de80-9442-c1fe-f5ed-fb2c4a4d1eda.htm
---
# Autodesk.Revit.DB.LevelAssociationData.GetLevelOffset Method

Returns the offset from the Associated Level.

## Syntax (C#)
```csharp
public double GetLevelOffset()
```